@edwardmedia , i see what you are trying say and that  makes sense, Attached is the logs with provider version 3.5.0 and it works perfectly there and you can see it call deletes to update the NS.

there is no change in plan though, it looks same for 3.69.0 and 3.5.0 
it just seems 3.69.0 is simply not calling up the  DELETE to update NS.


[tf_log_12.log](https://github.com/hashicorp/terraform-provider-google/files/6576996/tf_log_12.log)


plan from 3.5.0

`
Terraform will perform the following actions:

  # google_dns_managed_zone.selected will be created
  + resource "google_dns_managed_zone" "selected" {
      + description  = "Managed by Terraform"
      + dns_name     = "reddev.com."
      + id           = (known after apply)
      + name         = "d-reddev-com"
      + name_servers = (known after apply)
      + project      = (known after apply)
      + visibility   = "public"
    }

  # google_dns_record_set.add_ns_records will be created
  + resource "google_dns_record_set" "add_ns_records" {
      + id           = (known after apply)
      + managed_zone = "d-reddev-com"
      + name         = "reddev.com."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 86400
      + type         = "NS"
    }

plan from 3.69.0

` # google_dns_managed_zone.selected will be created
  + resource "google_dns_managed_zone" "selected" {
      + description   = "Managed by Terraform"
      + dns_name      = "reddev.com."
      + force_destroy = false
      + id            = (known after apply)
      + name          = "d-reddev-com"
      + name_servers  = (known after apply)
      + project       = (known after apply)
      + visibility    = "public"
    }

  # google_dns_record_set.add_ns_records will be created
  + resource "google_dns_record_set" "add_ns_records" {
      + id           = (known after apply)
      + managed_zone = "d-reddev-com"
      + name         = "reddev.com."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 86400
      + type         = "NS"
    }

Plan: 2 to add, 0 to change, 0 to destroy.




output of 3.5.0 apply 

<img width="1263" alt="Screenshot 2021-06-01 at 15 18 18" src="https://user-images.githubusercontent.com/14299991/120341537-dd8de100-c2ee-11eb-8d4a-612b309fc75d.png">

